// 004_Function.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#include <iostream>

// 함수에 대해서 좀더 알아봅시다.
// 함수는 => 행동 내가 하고 싶은일
// 함수를 안만들든 못만들든 => 하고 싶은일이 없다.

// 그 함수의 이름과 함수들을 통해서 => 
// 선생님은 학생이 뭘하고 싶어했는지 알수가 있다.

// 이름만 봐도
// void => 아무것도 리턴하지 않겠다.
// int => 숫자
// 이 일이 벌어지면 숫자가 1개 생긴다.
// void => 이일이 벌어질 뿐이다.
void Fight()
{ 
    
}

// main는 int라는 것을 삼았는데.
// 결과를 리턴하겠다는 의미가 있는데.

// 프로세스가 시작하고
int main()
{
    // 싸운다. 행동으로 표현하기 위해서
    // 함수로 만들어야 한다는 겁니다.
    Fight(); // 
    std::cout << "Hello World!\n";
}
